espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG22/Include/efr32mg22_gpio.h
/* Bit fields for GPIO EXTIPINSELH */
#define _GPIO_EXTIPINSELH_RESETVALUE                    0x00000000UL                                   /**< Default value for GPIO_EXTIPINSELH          */
#define _GPIO_EXTIPINSELH_MASK                          0x00003333UL                                   /**< Mask for GPIO_EXTIPINSELH                   */
#define _GPIO_EXTIPINSELH_EXTIPINSEL0_SHIFT             0                                              /**< Shift value for GPIO_EXTIPINSEL0            */
#define _GPIO_EXTIPINSELH_EXTIPINSEL0_MASK              0x3UL                                          /**< Bit mask for GPIO_EXTIPINSEL0               */
#define _GPIO_EXTIPINSELH_EXTIPINSEL0_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_EXTIPINSELH           */
#define _GPIO_EXTIPINSELH_EXTIPINSEL0_OFFSET8           0x00000000UL                                   /**< Mode OFFSET8 for GPIO_EXTIPINSELH           */
#define _GPIO_EXTIPINSELH_EXTIPINSEL0_OFFSET9           0x00000001UL                                   /**< Mode OFFSET9 for GPIO_EXTIPINSELH           */
#define _GPIO_EXTIPINSELH_EXTIPINSEL0_OFFSET10          0x00000002UL                                   /**< Mode OFFSET10 for GPIO_EXTIPINSELH          */
#define _GPIO_EXTIPINSELH_EXTIPINSEL0_OFFSET11          0x00000003UL                                   /**< Mode OFFSET11 for GPIO_EXTIPINSELH          */
#define GPIO_EXTIPINSELH_EXTIPINSEL0_DEFAULT            (_GPIO_EXTIPINSELH_EXTIPINSEL0_DEFAULT << 0)   /**< Shifted mode DEFAULT for GPIO_EXTIPINSELH   */
#define GPIO_EXTIPINSELH_EXTIPINSEL0_OFFSET8            (_GPIO_EXTIPINSELH_EXTIPINSEL0_OFFSET8 << 0)   /**< Shifted mode OFFSET8 for GPIO_EXTIPINSELH   */
#define GPIO_EXTIPINSELH_EXTIPINSEL0_OFFSET9            (_GPIO_EXTIPINSELH_EXTIPINSEL0_OFFSET9 << 0)   /**< Shifted mode OFFSET9 for GPIO_EXTIPINSELH   */
#define GPIO_EXTIPINSELH_EXTIPINSEL0_OFFSET10           (_GPIO_EXTIPINSELH_EXTIPINSEL0_OFFSET10 << 0)  /**< Shifted mode OFFSET10 for GPIO_EXTIPINSELH  */
#define GPIO_EXTIPINSELH_EXTIPINSEL0_OFFSET11           (_GPIO_EXTIPINSELH_EXTIPINSEL0_OFFSET11 << 0)  /**< Shifted mode OFFSET11 for GPIO_EXTIPINSELH  */
#define _GPIO_EXTIPINSELH_EXTIPINSEL1_SHIFT             4                                              /**< Shift value for GPIO_EXTIPINSEL1            */
#define _GPIO_EXTIPINSELH_EXTIPINSEL1_MASK              0x30UL                                         /**< Bit mask for GPIO_EXTIPINSEL1               */
#define _GPIO_EXTIPINSELH_EXTIPINSEL1_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_EXTIPINSELH           */
#define _GPIO_EXTIPINSELH_EXTIPINSEL1_OFFSET8           0x00000000UL                                   /**< Mode OFFSET8 for GPIO_EXTIPINSELH           */
#define _GPIO_EXTIPINSELH_EXTIPINSEL1_OFFSET9           0x00000001UL                                   /**< Mode OFFSET9 for GPIO_EXTIPINSELH           */
#define _GPIO_EXTIPINSELH_EXTIPINSEL1_OFFSET10          0x00000002UL                                   /**< Mode OFFSET10 for GPIO_EXTIPINSELH          */
#define _GPIO_EXTIPINSELH_EXTIPINSEL1_OFFSET11          0x00000003UL                                   /**< Mode OFFSET11 for GPIO_EXTIPINSELH          */
#define GPIO_EXTIPINSELH_EXTIPINSEL1_DEFAULT            (_GPIO_EXTIPINSELH_EXTIPINSEL1_DEFAULT << 4)   /**< Shifted mode DEFAULT for GPIO_EXTIPINSELH   */
#define GPIO_EXTIPINSELH_EXTIPINSEL1_OFFSET8            (_GPIO_EXTIPINSELH_EXTIPINSEL1_OFFSET8 << 4)   /**< Shifted mode OFFSET8 for GPIO_EXTIPINSELH   */
#define GPIO_EXTIPINSELH_EXTIPINSEL1_OFFSET9            (_GPIO_EXTIPINSELH_EXTIPINSEL1_OFFSET9 << 4)   /**< Shifted mode OFFSET9 for GPIO_EXTIPINSELH   */
#define GPIO_EXTIPINSELH_EXTIPINSEL1_OFFSET10           (_GPIO_EXTIPINSELH_EXTIPINSEL1_OFFSET10 << 4)  /**< Shifted mode OFFSET10 for GPIO_EXTIPINSELH  */
#define GPIO_EXTIPINSELH_EXTIPINSEL1_OFFSET11           (_GPIO_EXTIPINSELH_EXTIPINSEL1_OFFSET11 << 4)  /**< Shifted mode OFFSET11 for GPIO_EXTIPINSELH  */
#define _GPIO_EXTIPINSELH_EXTIPINSEL2_SHIFT             8                                              /**< Shift value for GPIO_EXTIPINSEL2            */
#define _GPIO_EXTIPINSELH_EXTIPINSEL2_MASK              0x300UL                                        /**< Bit mask for GPIO_EXTIPINSEL2               */
#define _GPIO_EXTIPINSELH_EXTIPINSEL2_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_EXTIPINSELH           */
#define _GPIO_EXTIPINSELH_EXTIPINSEL2_OFFSET8           0x00000000UL                                   /**< Mode OFFSET8 for GPIO_EXTIPINSELH           */
#define _GPIO_EXTIPINSELH_EXTIPINSEL2_OFFSET9           0x00000001UL                                   /**< Mode OFFSET9 for GPIO_EXTIPINSELH           */
#define _GPIO_EXTIPINSELH_EXTIPINSEL2_OFFSET10          0x00000002UL                                   /**< Mode OFFSET10 for GPIO_EXTIPINSELH          */
#define _GPIO_EXTIPINSELH_EXTIPINSEL2_OFFSET11          0x00000003UL                                   /**< Mode OFFSET11 for GPIO_EXTIPINSELH          */
#define GPIO_EXTIPINSELH_EXTIPINSEL2_DEFAULT            (_GPIO_EXTIPINSELH_EXTIPINSEL2_DEFAULT << 8)   /**< Shifted mode DEFAULT for GPIO_EXTIPINSELH   */
#define GPIO_EXTIPINSELH_EXTIPINSEL2_OFFSET8            (_GPIO_EXTIPINSELH_EXTIPINSEL2_OFFSET8 << 8)   /**< Shifted mode OFFSET8 for GPIO_EXTIPINSELH   */
#define GPIO_EXTIPINSELH_EXTIPINSEL2_OFFSET9            (_GPIO_EXTIPINSELH_EXTIPINSEL2_OFFSET9 << 8)   /**< Shifted mode OFFSET9 for GPIO_EXTIPINSELH   */
#define GPIO_EXTIPINSELH_EXTIPINSEL2_OFFSET10           (_GPIO_EXTIPINSELH_EXTIPINSEL2_OFFSET10 << 8)  /**< Shifted mode OFFSET10 for GPIO_EXTIPINSELH  */
#define GPIO_EXTIPINSELH_EXTIPINSEL2_OFFSET11           (_GPIO_EXTIPINSELH_EXTIPINSEL2_OFFSET11 << 8)  /**< Shifted mode OFFSET11 for GPIO_EXTIPINSELH  */
#define _GPIO_EXTIPINSELH_EXTIPINSEL3_SHIFT             12                                             /**< Shift value for GPIO_EXTIPINSEL3            */
#define _GPIO_EXTIPINSELH_EXTIPINSEL3_MASK              0x3000UL                                       /**< Bit mask for GPIO_EXTIPINSEL3               */
#define _GPIO_EXTIPINSELH_EXTIPINSEL3_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_EXTIPINSELH           */
#define _GPIO_EXTIPINSELH_EXTIPINSEL3_OFFSET8           0x00000000UL                                   /**< Mode OFFSET8 for GPIO_EXTIPINSELH           */
#define _GPIO_EXTIPINSELH_EXTIPINSEL3_OFFSET9           0x00000001UL                                   /**< Mode OFFSET9 for GPIO_EXTIPINSELH           */
#define _GPIO_EXTIPINSELH_EXTIPINSEL3_OFFSET10          0x00000002UL                                   /**< Mode OFFSET10 for GPIO_EXTIPINSELH          */
#define _GPIO_EXTIPINSELH_EXTIPINSEL3_OFFSET11          0x00000003UL                                   /**< Mode OFFSET11 for GPIO_EXTIPINSELH          */
#define GPIO_EXTIPINSELH_EXTIPINSEL3_DEFAULT            (_GPIO_EXTIPINSELH_EXTIPINSEL3_DEFAULT << 12)  /**< Shifted mode DEFAULT for GPIO_EXTIPINSELH   */
#define GPIO_EXTIPINSELH_EXTIPINSEL3_OFFSET8            (_GPIO_EXTIPINSELH_EXTIPINSEL3_OFFSET8 << 12)  /**< Shifted mode OFFSET8 for GPIO_EXTIPINSELH   */
#define GPIO_EXTIPINSELH_EXTIPINSEL3_OFFSET9            (_GPIO_EXTIPINSELH_EXTIPINSEL3_OFFSET9 << 12)  /**< Shifted mode OFFSET9 for GPIO_EXTIPINSELH   */
#define GPIO_EXTIPINSELH_EXTIPINSEL3_OFFSET10           (_GPIO_EXTIPINSELH_EXTIPINSEL3_OFFSET10 << 12) /**< Shifted mode OFFSET10 for GPIO_EXTIPINSELH  */
#define GPIO_EXTIPINSELH_EXTIPINSEL3_OFFSET11           (_GPIO_EXTIPINSELH_EXTIPINSEL3_OFFSET11 << 12) /**< Shifted mode OFFSET11 for GPIO_EXTIPINSELH  */

/* Bit fields for GPIO EXTIRISE */
#define _GPIO_EXTIRISE_RESETVALUE                       0x00000000UL                           /**< Default value for GPIO_EXTIRISE             */
#define _GPIO_EXTIRISE_MASK                             0x00000FFFUL                           /**< Mask for GPIO_EXTIRISE                      */
#define _GPIO_EXTIRISE_EXTIRISE_SHIFT                   0                                      /**< Shift value for GPIO_EXTIRISE               */
#define _GPIO_EXTIRISE_EXTIRISE_MASK                    0xFFFUL                                /**< Bit mask for GPIO_EXTIRISE                  */
#define _GPIO_EXTIRISE_EXTIRISE_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for GPIO_EXTIRISE              */
#define GPIO_EXTIRISE_EXTIRISE_DEFAULT                  (_GPIO_EXTIRISE_EXTIRISE_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_EXTIRISE      */

